Reports/бит_ВыпискаИзДомовойКниги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_ВыпискаИзДомовойКниги</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияПроживающих</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проживающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьНаОдного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияПрописки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/бит_ФИОПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ФИОПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/бит_ВыпискаИзДомовойКниги/Forms/ФормаОтчетаУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
		Если НЕ Отчет.ФормироватьНаОдного Тогда
	
		Элементы.Проживающий.Доступность 	= Ложь;
		Элементы.Проживающий.Видимость 	= Ложь;
	
	Иначе
	
		Элементы.Проживающий.Доступность 	= Истина;
		Элементы.Проживающий.Видимость 	= Истина;
	
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	
	ТаблицаРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТаблицаРезультат.Напечатать();

КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьНаСервере(ВыборМакета);
	
	// БИТ_ЖКХ 21.03.2017 11:09:48 Начало правки... 
	ОтображениеСостояния = Элементы.ТаблицаРезультат.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Ложь;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	ОтображениеСостояния.Текст							= "";
	Элементы.ТаблицаРезультат.Доступность				= Истина;
	// БИТ_ЖКХ 21.03.2017 11:09:49 Конец правки. 
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере(ВыборМакета)
	
	ОтчетОбъект = ДанныеФормыВЗначение(Отчет, Тип("ОтчетОбъект.бит_ВыпискаИзДомовойКниги"));
	ОтчетОбъект.СформироватьОтчет(ТаблицаРезультат,ВыборМакета);
	ЗначениеВДанныеФормы(ОтчетОбъект,Отчет);
	
КонецПроцедуры

// БИТ_ЖКХ 21.03.2017 9:58:57 Начало правки... 
&НаКлиенте
Процедура ФормироватьНаОдногоПриИзменении(Элемент)
	
	Если НЕ Отчет.ФормироватьНаОдного Тогда
		Элементы.Проживающий.Доступность = Ложь;
		Элементы.Проживающий.Видимость 	 = Ложь;
		Отчет.Проживающий = ПредопределенноеЗначение("Справочник.бит_Проживающие.ПустаяСсылка");
	Иначе
		Элементы.Проживающий.Доступность = Истина;
		Элементы.Проживающий.Видимость	 = Истина;
		ОбновитьСписокПроживающих();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПроживающих()
	
	СписокФизЛиц = СписокПроживающих(Отчет.Дата, Отчет.ЛицевойСчет, Отчет.ИсторияПроживающих);
	Элементы.Проживающий.СписокВыбора.ЗагрузитьЗначения(СписокФизЛиц);
	
КонецПроцедуры

//&НаСервере 
//Функция ОбновитьСписокПроживающихСервер()
//	
//	//ОтчетОбъект = ДанныеФормыВЗначение(Отчет, Тип("ОтчетОбъект.бит_ВыпискаИзДомовойКниги"));
//	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
//	Возврат ОтчетОбъект.СписокПроживающих();
//	
//КонецФункции


// Функция формирует список физ лиц, когда-либо прописанных на ЛС (ВесьСписок = Ложь).
// Либо тех, кто прописан на момент даты документа (ВесьСписок = Истина).
&НаСервереБезКонтекста
Функция СписокПроживающих(Дата, ЛицевойСчет, ИсторияПроживающих) 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ЕСТЬNULL(бит_ФИОПроживающихСрезПоследних.Фамилия, """") КАК Фамилия,
	|	ЕСТЬNULL(бит_ФИОПроживающихСрезПоследних.Имя, """") КАК Имя,
	|	ЕСТЬNULL(бит_ФИОПроживающихСрезПоследних.Отчество, """") КАК Отчество
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Дата, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);

	Если НЕ ИсторияПроживающих Тогда
		ЗапросСхемы	   = СхемаЗапроса.ПакетЗапросов[0];
		ОператорВыбора = ЗапросСхемы.Операторы[0];
		ОператорВыбора.Отбор.Добавить("(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))");
	КонецЕсли; 
	
	Запрос = Новый Запрос(СхемаЗапроса.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	МассивФизЛиц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизЛицо");
	Возврат МассивФизЛиц;   
  
КонецФункции // СписокПроживающих()

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбновитьСписокПроживающих();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	ОбновитьСписокПроживающих();
	ОтображениеСостояния = Элементы.ТаблицаРезультат.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Истина;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	ОтображениеСостояния.Текст                          = НСтр("ru = 'Отчет не сформирован. Нажмите ""Сформировать отчет""..'");
	Элементы.ТаблицаРезультат.Доступность				= Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПроживающихПриИзменении(Элемент)
	
	ОбновитьСписокПроживающих();

КонецПроцедуры
// БИТ_ЖКХ 21.03.2017 9:58:59 Конец правки. 

#КонецОбласти
